# SAGUARO Adapter Vocab
# Frequency | N-gram (Bytes)
6624584	  
5464053	   
4490787	    
3542213	     
2906757	      
2336290	       
1893200	        
1224855	\n 
1107468	\n  
935517	\n   
921473	\n    
735385	on
724434	er
719823			
713311	re
646938	in
634312	e 
623624	;\n
619599	at
613521	\n     
586046	te
566090	or
553172	\n      
539073	, 
530432	en
514053	th
512364	t 
497869	 t
488277	de
486090	= 
485419	 =
473681	st
453092	ti
446425	\n	
432293	nt
429834	\n       
421300	ar
413721	et
404188	se
403064	co
400772	: 
399213	es
393948				
391340	le
391133	==
386226	 = 
374226	al
373246	is
359975	 i
356840	s 
354985	ct
348810	io
343973	 {
342428	n 
336583	 *
331994	ion
329822	ra
326300	 c
326259	ns
324802	\n		
323504	\n\n
308830	ro
300631	;\n 
300256	pe
295681	===
294938	;\n  
290554	 s
290471	ta
287211	tio
285749	) 
285265	tion
284566	me
281401	tr
279811	ec
279247	he
279007	 a
271898	ur
271754	ri
271526	nd
270789	);
263015	ex
261863	* 
259563	 f
259474	r 
254925	ng
250732	an
250126	,\n
250000	s.
248893	ed
248732	ne
244661	 th
242194	{\n
241606	;\n   
241500	;\n    
241406	====
238928	);\n
238036	 * 
237940	=====
235047	con
234512	======
232748	rt
232156	 {\n
231127	=======
228721	 r
228216	to
227742	========
221675	 n
221319	hi
218657	od
217972	un
216455	it
214820	 (
211384	ons
209772	as
208644					
207366	ce
204186	ent
201869	nc
198661	--
198288	ate
197939	f 
197852	 }
195999	tu
193533	po
192353	ma
190430	ea
189845	---
189275	am
189203	d 
188867	ul
188107	 o
186857	,\n 
186127	ve
185177	----
185173	\n			
185043	,\n  
183547	\n\n	
183040	ge
181874	pa
181346	-----
180641	if
178013	------
177456	lo
176668	tur
176031	om
176022	 p
175639	ing
175505	li
175019	-------
172100	--------
171049	{\n 
170750	 re
170568	va
169707	{\n  
169665	 d
169443	}\n
168903	 co
168656	ut
168164	ect
167411	rn
166079	his
165698	 e
165447	nst
165396	ac
163107	 {\n 
161928	 {\n  
159204	ue
158599	ou
157749	thi
157720	e.
157185	el
157010	si
155834	) {
154722	ad
154569	fi
154044	ty
153911	yp
153844	ll
153390	 v
153309	ca
153074	this
153044	ef
152729	 "
152240	ter
152063	ch
151747	,\n   
151339	,\n    
149479	ode
149174	) {\n
148956	cons
148760	 b
147418	he 
147182	ype
145919	 )
145473	 0
145369	la
145298	{\n   
145132	di
145058	{\n    
143704	\n\n		
143598	ts
143486	op
143363	rr
142941	st 
142553	onst
141486	cti
140980	;\n     
139260	the
138938	;\n      
138721	 {\n   
138591	 {\n    
137420	ss
137375	const
136077	no
135965	pr
135865	;\n\n
134727	mp
134505	 1
134007	  }
133925	//
133579	etu
132591	urn
132286	id
132269	turn
132013	etur
131998	eturn
130405	im
130013	ol
129907	( 
129231	ctio
129230	ction
129046	ret
127517	il
126741	fo
125591	ic
125389	ort
124479	ha
124145	nu
123742	 m
123483	on 
123303	retu
123299	retur
123299	return
122840	 the
121721	 in
121533	tri
121134	()
121075	nst 
120622	onst 
120595	em
120585	const 
120350	is.
119715	);\n 
119052	his.
119016	this.
117877	B 
117601	ig
116976	rs
116724	y 
116717	\n *
116594	lu
116399	);\n  
116092	por
115543	",
115380	port
114889	um
114512	us
114076	 l
113853	 '
113521	be
113507	the 
112508	 the 
109894	ion 
109521	e(
109495	0.
109442	xp
109063	 con
108885	xt
108064	na
107778	,\n     
107257	t.
106777						
106352	.\n
106116	for
105993	,\n      
105693	if 
104957	m 
103927	ext
103557	  *
103295	int
102959	pt
102391	   }
102163	rn 
102119	   *
101825	\n				
101710	nde
101634	    }
101615	ap
101396	 T
99903	urn 
99889	turn 
99746	eturn 
99657	rea
99603	{\n     
99468	 u
99350	unc
99098	return 
98615	{\n      
98014	) {\n 
97651	ls
97501	) {\n  
97482	tion 
97321	Co
96799	typ
96722	/ 
96104	t(
96011	ame
95930	type
95411	 thi
94970	 {\n     
94801	ke
94796	ati
94758	lt
94400	":
94207	or 
94186	 this
93999	nct
93950	 /
93869	unct
93858	fa
93745	par
93507	ncti
93497	nction
93497	nctio
93475	uncti
93471	unctio
93471	unction
93458	fu
93415	sta
92204	l 
91940	);\n   
91891	);\n    
91343	  c
90851	ni
90741	ay
90522	str
90330	e,
89626	exp
89309	Re
88951	 w
88899	ot
88785	of
88750	ed 
88402	;\n\n	
88319	tor
88247	    *
87881	.0
87721	 st
87221	 }\n
86761	ia
86602	     *
86493	f (
86191	} 
86147	if (
85872	) {\n   
85832	) {\n    
85822	so
85694	res
85590	men
85128	nte
84549	fun
84495	der
84394	func
84139	tat
84053	da
83817	end
83761	o 
83017	\n * 
82627	funct
82621	function
82621	functio
82621	functi
82483	def
81924	ine
81595	  }\n
81242	ment
81168	val
81157	pl
80899	 if
80839	;\n	
80663	  i
80639	 @
80638	*\n
80473	er 
80024	**
79864	sh
79847	sc
79802	// 
79708	ren
79349	ie
79154	get
78951	a 
78893	 if 
78831	se 
78345	 g
78236	C 
77927	rm
77894	lue
77730	ck
77607	   c
77383	* @
77365	alu
77332	rt 
77270	\n\n			
77129	tt
77047	ff
76734	  r
76683	Ma
76514	e:
76482	    c
76421	alue
75706	g 
75583	 |
75395	 ret
75386	su
75369	 -
74965	 +
74919	h 
74876	 va
74659	ag
74618	In
74457	mb
74401	.s
74195	.c
74048	 nu
74021	je
73803	 to
73741	e =
73716	jec
73712	ject
73632	e)
73149	 retu
73145	 retur
73145	 * @
73145	 return
73138	  * 
73110	pu
73084	> 
72827	ry
72595	== 
72309	atio
72308	   * 
72237	ult
72200	 cons
71940	ram
71837	cl
71799	  re
71775	ow
71144	oa
70897	;\n\n		
70714	fe
70651	}\n 
70518	is 
70436	ara
70378	ation
70336	fr
70247	| 
70070	oo
70052	bj
69848		 
69825	St
69716	0 
69438	var
69242	 [
69070	No
68581	oi
68543	xpo
68525	bl
68517	ort 
68310	   i
68307	orm
68240	 this.
68185	os
68021	dat
67972	),
67966	    i
67754	port 
67733	ar 
67678	rg
67649	 h
67455	 de
67352	.\n 
67211	)\n
66951	,"
66909	 const
66892	}\n\n
66681	xport
66681	xpor
66348	}\n  
66020	of 
65968	ction 
65702	cr
65305	ew
64918	 }\n 
64912	mat
64869	expo
64591	ata
64416	rom
64383	pro
64332	rin
64330	mi
64289	 _
64223	ht
64155	ru
64110	per
63905	 }\n  
63748	bje
63733	bjec
63733	bject
63703	bu
63630	   }\n
63568	export
63568	expor
63453	 return 
63370	    }\n
63187	ess
62921	r(
62859	/*
62841	- 
62836	set
62778	*/
62720	w 
62654	    * 
62567	num
62521	;\n		
62519	{ 
62317	ert
62228	   r
62165	))
62147	ab
62120	  co
61877	 ) 
61867	ath
61849	 if (
61836	  }\n 
61812	ey
61730	r.
61727	    r
61657	  }\n  
61565	es 
61485	     * 
61337	tex
61281	 );
61268	ont
61169	 const 
61083	ng 
61058	ir
60915	ring
60877	ten
60840	     }
60820	 fo
60818	to 
60732	*\n 
60633	0,
60623	qu
60572	.p
60527	      }
60441	 2
60374	s:
60351	 is
60180	nt 
60053	\n     *
59990	e: 
59981	mbe
59916	mo
59914	rop
59897	valu
59834	 );\n
59768	);\n     
59682	ing 
59650	iz
59525	Pr
59487	var 
59445	ase
59358		}
59022	value
58810	 no
58701	ep
58635	nction 
58616	unction 
58536	ba
58509	);\n\n
58179	  /
58162	ull
57998	n(
57862	e = 
57853	   re
57807	ber
57503	  if
57415	    re
57296	"1
57223	  if 
56908	 - 
56908	 to 
56881	oc
56571	ld
56569	 `
56122	 { 
56086		 *
55934	ers
55912	  con
55900	pre
55857	 */
55779	  ret
55738	 S
55733	fin
55716	ee
55679	ze
55629	+ 
55518	 pr
55471	  return
55471	  retu
55471	  retur
55447	aram
55442	\n\n 
55433	 an
55376	e;
55245	\n\n  
55231	mber
55171	ps
55127	/\n
55044	trin
54850	Th
54816	rc
54814	loa
54786	0.0
54754	au
54676	 ==
54637	ob
54475	e, 
54459	 of
54377	js
54306	tring
54293	1 
54221	 A
54174	do
54141	 for
54085	nce
54004	},
53896	ray
53760	gh
53542	and
53531		c
53389							
53378	\n					
53362	ip
53340	lse
53300	wi
53187	all
53121	nod
53077	  t
53074	t,
53073	sp
52973	node
52946	com
52900	   }\n 
52868	 C
52814	  if (
52758	iti
52748	   }\n  
52729	stri
52690	bo
52679	    }\n 
52617	    }\n  
52605	fl
52590	iv
52521	 ex
52430	ly
52405	are
52213	fer
52115	 pa
52093	tate
51934	s,
51931	 ca
51927	cu
51902	; 
51836	(t
51763	ver
51742	ev
51720	 R
51599	*/\n
51431	et 
51429	ize
51232	ial
51158	}\n   
51154	rra
51038	umb
51010	: "
50936	ble
50926	}\n    
50894	Ty
50814	cto
50788	.t
50785	Typ
50766	umbe
50746	che
50744	ctor
50640	 fr
50599	umber
50532	/**
50527	rray
50494	 ne
50491	Type
50471	nul
50414	   co
50397	para
50346	cal
50343	null
50279	 */\n
50212	 + 
50053	Pa
50036	tc
50015	ai
49832	  cons
49727	2 
49662	 | 
49543	    co
49542	for 
49429	ions
49338	lin
49316	 se
49293	ope
49251	text
48982	 }\n   
48894	 }\n    
48859	put
48850	ind
48786	nf
48754	era
48725	Nod
48716	Node
48668	fro
48630	rro
48591	use
48466	e;\n
48289	\n}
48268	Pro
48214	ure
48190	   if
48074	   /
48056	    if
48036	     c
48019	 ma
47972	   if 
47922	 //
47901	  const
47886	from
47882	out
47876	] 
47839	    if 
47749	:0
47724	      c
47680	=>
47658	 a 
47598	", 
47592	   t
47577	igh
47515	Li
47472	s =
47247	ria
47247	  }\n   
47240	mpo
47231	De
47229	   }\n   
47218	  }\n    
47207	    t
47114	omp
47009	tru
47007	efi
46980	    /
46922	up
46901	("
46785	 ===
46780	arg
46776	ho
46353	AA
46337	new
46286	 tr
46258	param
46182	tch
46180	act
46089	00
46086	 of 
46026	 // 
45970	\ne
45958	len
45938	t =
45796	rat
45688	ute
45646	\nex
45587	).
45521	\nexp
45509	eri
45486	\nexpo
45484	\nexpor
45484	\nexport
45468	om 
45437	nter
45436	 I
45377	= t
45375	und
45360	ist
45344	{\n\n
45302	 {\n\n
45240	 0.
45143	ror
45125	rror
45115	._
45110	**\n
45085	pat
45085	":0
45025	>>
45022	re 
45007			c
45007	   con
44960	  const 
44895	")
44677	pe 
44612	s)
44600	e t
44598	ead
44542	nts
44431	/**\n
44419	numb
44403	{\n\n	
44366	 {\n\n	
44321	numbe
44321	number
44291	s(
44214	&&
44211	   ret
44194	    con
44119	efin
44092	     i
44091	];
43977	      i
43926	   retu
43926	   retur
43925		co
43916	    ret
43915	eo
43896	gi
43880	,\n	
43817	th 
43701	  s
43634	    retu
43600	.l
43590	 for 
43579	ass
43571	   if (
43547	ens
43514	s = 
43502	x 
43497	ted
43447	    if (
43406	],
43387	0;
43314	       }
43274	__
43190	=== 
43190	Ar
43164	)\n 
43163	ght
43121	 === 
43064	in 
42913	 fro
42907	tions
42901	eg
42884	 Th
42619	abl
42618	ci
42544	ture
42538	\n     * 
42510	 from
42499	t)
42446	ce 
42395	pti
42392	.a
42323	 ty
42303	r,
42205	 M
42189	est
42187	 typ
42073	rom 
42060	\n/
42049	 val
42030	strin
42028	string
41960	from 
41946	able
41883	Mat
41819	.i
41812	\n\n   
41765	\n\n    
41758	 =>
41709	.d
41679	1,
41654	})
41611			}
41577	 fu
41552	met
41496	ight
41462	 type
41400		con
41385	12
41384	e_
41375	:0.
41342	=> 
41276	data
41228	le 
41169	":0.
41157	ew 
41147	pp
41139	te 
41130	uc
41121	de 
41085	.m
41067	 => 
40934	 un
40915	tar
40909	t = 
40875		}\n
40807	);\n\n	
40794	 from 
40788	D 
40754	xport 
40751	 } 
40750	n t
40736	)\n  
40710	./
40669	\n	 
40627	export 
40623	= n
40592	nam
40562	ds
40556	ace
40463	){
40440	ype 
40439	ib
40410	 3
40388	art
40386	{\n\n		
40350	 {\n\n		
40321	sio
40321	sion
40256	ffe
40253	  f
40252	age
40200	efa
40178	e i
40177	imp
40170	aul
40141	10
40107	i 
40105	 k
40010	     r
39957	\n    }
39957	 is 
39941	ault
39934	) =
39916	fau
39913	faul
39913	fault
39869	:\n
39848	efault
39848	efau
39848	efaul
39807	      r
39785	Sta
39764	als
39698	_s
39658	 P
39498	   s
39377	gt
39376		cons
39334	gr
39323	..
39295	   cons
39253	key
39242	nd 
39225	new 
39206	(e
39200	    s
39130	n.
38986	sa
38902	du
38885	eng
38698	 fun
38627	 func
38550	\n\n				
